# Семинар №4
## Задание №1

Напишите программу, которая
принимает на вход число (А) и выдаёт сумму чисел
от 1 до А.

```C#
int SUMNUMBER (int a )
{
    int result = 0;
    for (int i = 0; i <= a; i++)
    {
        result = result + i;
    }
    return result;
}

int A = int.Parse(Console.ReadLine());
int res = SUMNUMBER(A);
Console.WriteLine(res);
```

## Задание № 2
Напишите программу, которая принимает
на вход число и выдаёт количество цифр в числе.

```C#
Console.Write("Введите число: ");
string input = Console.ReadLine();        
int digitCount = CountDigits(input);
Console.WriteLine("Количество цифр в числе: " + digitCount);

int CountDigits(string number)
    {
        return number.Length; // Возвращаем количество цифр
    }
```

## Задание №3
/*
Напишите программу, которая
принимает на вход число N и выдаёт
произведение чисел от 1 до N.

```C#
int proizvideni(int n)
{
    int result = 1;
    for (int i = 1; i <= n; i++)
    {
        result = result * i;
    }
    return result;
}

int N = int.Parse(Console.ReadLine());
int res = proizvideni(N);
Console.WriteLine(res);
```
## Задание №4
Напишите программу, которая
выводит массив из 8 элементов, заполненный
нулями и единицами в случайном порядке.

```C#
Random rnd = new Random();

int[] matrix = new int[8];
for (int i = 0; i < matrix.GetLength(0); i++)
{
    matrix[i] = rnd.Next(0, 2);
}

for (int i = 0; i < matrix.GetLength(0); i++)
{
    Console.WriteLine($"{matrix[i]},");
}
```

# Домашняя работа
## Задание №1

Напишите цикл, который принимает на вход
два числа (A и B) и возводит число A в натуральную
степень B.

```C#

double stepen(int numberA, int numberB)
{
    double result = Math.Pow(numberA, numberB);
    return result;
}

int A = int.Parse(Console.ReadLine());
int B = int.Parse(Console.ReadLine());
double res = stepen(A, B);
Console.WriteLine(res);

```

## Задание № 2
Напишите программу, которая принимает на
вход число и выдаёт сумму цифр в числе.

```C#
int SumNumbers(int value)
{
    int sum = 0;
    while (value > 0)
    {
        sum = sum + value % 10;
        value = value / 10;
    }
    return sum;
}

int N = int.Parse(Console.ReadLine());
int result = SumNumbers(N);
Console.WriteLine(result);
```
## Задание №3
Напишите программу, которая задаёт массив
из 8 элементов и выводит их на экран.

```C#
int[] massiv = new int[8];
Random rnd = new Random();
for (int i = 0; i < massiv.GetLength(0); i++)
{
    massiv[i] = rnd.Next(1, 100);
}

for (int i = 0; i < massiv.GetLength(0); i++)
{
    Console.WriteLine($"{massiv[i]} ,");
}
```