# Семинар

## Задача 1 

### Условие

**Напишите программу, которая на вход будет принимать число и выдавать его квадрат**

### Решение

#### Код

**`Console.WriteLine("Введите число");`**

**`int number=int.Parse(Console.ReadLine());`**

**`int square=number*number;`**

**`Console.WriteLine($"Квадрат числа {number} равен {square}")`**

## Задача 2

### Условие

Напишите программу, которая на вход принимает два числа и проверяется является ли первое число квадратом первого

### Решение

#### КОД

**`int numberA=int.Parse(Console.ReadLine());`**

**`int numberB=int.Parse(Console.ReadLine());`**

**`if (numberB*numberB==numberA)`**

**`{`**

**`Console.WriteLine("Да");`**

**`}`**

**`else`**

**`{`**

**`Console.WriteLine("Нет");`**

**`}`**

## Задача 3

### Условие 

Напишите программу, которая будет выдавать название дня недели по заданному номеру 

### Решение

#### КОД

**`int number = int.Parse(Console.ReadLine());`**

**`if (number == 1)`**

**`{`**

**`Console.WriteLine("Понедельник");`**

**`}`**

**`else if (number == 2)`**

**`{`**

**`Console.WriteLine("Вторник");`**

**`}`**

**`else if (number == 3)`**

**`{`**

**`Console.WriteLine("Среда");`**

**`}`**

**`else if (number == 4)`**

**`{`**

**`Console.WriteLine("Четверг");`**

**`}`**

**`else if (number == 5)`**

**`{`**

**`Console.WriteLine("Пятница");`**

**`}`**

**`else if (number == 6)`**

**`{`**

**`Console.WriteLine("Суббота");`**

**`}`**

**`else if (number == 7)`**

**`{`**

**`Console.WriteLine("Воскресенье");`**

**`}`**

**`else`**

**`{`**

**`Console.WriteLine("Нет такого");`**

**`}`**

## Задача 4

### Условие

Напишите программу, которая на вход принимает одно число N  а на выходе все целые числа от -N до N

### Решение
#### КОД

**`Console.WriteLine("Введите целое число");`**

**`int numberA=int.Parse(Console.ReadLine());`**

**`int count=-numberA;`**

**`while (numberA>=count)`**

**`{`**

**`Console.WriteLine(count);`**

**`count++;`**

**`}`**

## Задача 5

### Условие 

Напишите программу, которая на вход принимает трехзначное число и на выходе показывает последнюю цифру

### Решение

#### КОД

**`int number=int.Parse(Console.ReadLine());`**

**`int info = number%10;`**

**`Console.WriteLine(info);`**

# Домашнее задание

## Задача 1

### Условие
Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

### Решение

#### Код

**`int numberA=int.Parse(Console.ReadLine());`**

**`int numberB=int.Parse(Console.ReadLine());`**

**`int min=0;`**

**`int max=0;`**

**`if (numberA>numberB)`**

**`{`**

**`max=numberA;`**

**`min=numberB;`**

**`else`**

**`{`**

**`max=numberB;`**

**`min=numberA;`**

**`}`**

**`Console.WriteLine($"min={min}, max={max}");`**

## Задача 2

### Условие

Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

### Решение

#### КОД

**`int a=int.Parse(Console.ReadLine());`**

**`int b=int.Parse(Console.ReadLine());`**

**`int c=int.Parse(Console.ReadLine());`**

**`int max=a;`**

**`if (b>max)`**

**`{`**

**`max=b;`**

**`}`**

**`if (c>max)`**

**`{`**

**`max=c;`**

**`}`**

**`Console.WriteLine(max);`**

## Задача 3

### Условие 

Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

### Решение

#### Код

**`int number=int.Parse(Console.ReadLine());`**

**`if (number%2==0)`**

**`{`**

**`Console.WriteLine("Да");`**

**`}`**

**`else`**

**`{`**

**`Console.WriteLine("Нет");`**

**`}`**

## Задача 4

### Условие

Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

### Решение

#### КОД

**`int number = int.Parse(Console.ReadLine());`**

**`int count = 1;`**

**`while (number >= count)`**

**`{`**

**`if (count % 2 == 0)`**

**`{`**

**`Console.WriteLine(count);`**

**`}`**

**`count++;`**

**`}`**

