# Семинар №2. Базовые алгоритмы 

## Задача 1 
Напишите программу, которая выводит
случайное число из отрезка [10, 99] и показывает
наибольшую цифру числа.
78 -> 8
12-> 2
85 -> 8


```C#
int Max(int random)
{
    int first = random / 10;
    int second = random % 10;
    int max = first;
    if (second > max) max = second;
    return max;
}


int random = new Random().Next(10, 99);
int maximum = Max(random);
Console.WriteLine(random);
Console.WriteLine($"maximum={maximum}");
```

## Задача 2
Напишите программу, которая принимает на вход
трёхзначное число и на выходе показывает вторую
цифру этого числа.
456 -> 5
782 -> 8
918 -> 1

```C#
int second(int number)
{
    int second = (number / 10) % 10;
    return second;
}

int number = int.Parse(Console.ReadLine());
int result = second(number);
Console.WriteLine(result);
```

## Задча 3
Напишите программу, которая принимает на
вход число и проверяет, кратно ли оно
одновременно 7 и 23.
14 -> нет
46 -> нет
161 -> да


```C#
void crat_7_23(int number)
{
    if ((number % 7 == 0) & (number % 23 == 0))
    {
        Console.WriteLine("Да");
    }
    else
    {
        Console.WriteLine("Нет");
    }
}

int number = int.Parse(Console.ReadLine());
crat_7_23(number);
```

## Задача 4
Напишите программу, которая принимает на
вход два числа и проверяет, является ли одно
число квадратом другого.
5, 25 -> да
-4, 16 -> да
25, 5 -> да
8,9 -> нет

```C#
void squard(int arg1, int arg2)
{
    if ((arg1 *arg1 == arg2) | (arg2 * arg2 == arg1))
    {
        Console.WriteLine("Да");
    }
    else
    {
        Console.WriteLine("Нет");
    }
}
Console.WriteLine("Введите первое число :");
int numberA = int.Parse(Console.ReadLine());
Console.WriteLine("Введите второе число :");
int numberB = int.Parse(Console.ReadLine());
squard(numberA, numberB);
```
