# Семинар Базовые алгоритмы продолжение 

## Задание 1
### Условие 
Напишите программу, которая принимает на вход
координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт
номер четверти плоскости, в которой находится эта
точка.
### Решение 
### Код
```C#
Console.WriteLine("Введите координаты точки X :");
int PositionX=int.Parse(Console.ReadLine());
Console.WriteLine ("Введите координаты Y :");
int PositionY=int.Parse(Console.ReadLine());
int diaposon=quart(PositionX,PositionY);

if (diaposon!=0)
{
    Console.WriteLine($"Четверть : {diaposon}");
}
else
 {
    Console.WriteLine("Коордитанты находятся на оси или в начале");
}

int quart(int X, int Y)
{
    if (X>0 && Y>0)
    {
        return 1;// первая четверть
    }
     else if (X<0 && Y>0)
    {
        return 2; // вторая четверть
    }
    else if (X<0 && Y<0)
    {
        return 3; // третья четверть 
    }
    else if (X>0 && Y<0)
    {
        return 4; // четвертая четверть 
    }
    return 0; // координаты на осях 
}
```
## Задача 2

### Условие 

Напишите программу, которая по
заданному номеру четверти, показывает
диапазон возможных координат точек в этой
четверти (x и y).

### Решение 

### Код

```C#
Console.WriteLine("Введите номер четверти");
int num=int.Parse(Console.ReadLine());
void diaposon (int number)
{
    if (number==1)
    {
        Console.WriteLine("X>0 Y>0");
    }
    if (number==2)
    {
        Console.WriteLine("X<0 Y>0");
    }
    if (number==3)
    {
        Console.WriteLine("X<0 Y<0");
    }
    if (number==4)
    {
        Console.WriteLine("X>0 Y<0");
    }
}
```

## Задача 3 
### Условие

Напишите программу, которая
принимает на вход координаты двух точек и
находит расстояние между ними в 2D
пространстве.
A (3,6); B (2,1) -> 5,09
A (7,-5); B (1,-1) -> 7,21

### Решение 
### Код
```C#
Console.WriteLine("Введите координаты  X точки A  ");
int PositionXA=int.Parse(Console.ReadLine());
Console.WriteLine("Введите координаты Y точки A");
int PositionYA=int.Parse(Console.ReadLine());
Console.WriteLine("Введите координаты  X точки B  ");
int PositionXB=int.Parse(Console.ReadLine());
Console.WriteLine("Введите координаты Y точки B");
int PositionYB=int.Parse(Console.ReadLine());
double distantion(int XA, int YA, int XB, int YB)
{
    int XAB=XB-XA;
    int YAB=YB-YA;
    int sqrtXAB=XAB*XAB;
    int sqrtYAB=YAB*YAB
    double result=Math.Sqrt(sqrtXAB+sqrtYAB);
    return result;
}
double res=distantion(PositionXA, PositionYA, PositionXB, PositionYB);
Console.WriteLine(res);
```

#### Важыне моменты
```C#
Math.Sqrt(X);
``` 
- Извлечение квадратного корня

## Задача 4
### Условие
Напишите программу, которая
принимает на вход число (N) и выдаёт таблицу
квадратов чисел от 1 до N.

### Решение
### Код

```C#
Console.WriteLine("Введите число N");
int N=int.Parse(Console.ReadLine());
for (int i=1; i<=N; i++)
{
    int k=i**i
    if(k!=N){
        Console.Write($"{k}");
        Console.Write(",");
    }
    else if (k==N)
    {
        Console.Write(k);
    }
}
```

## Домашняя работа 

### Задача 1 
#### Условие 

Напишите программу, которая принимает на
вход пятизначное число и проверяет, является ли оно
палиндромом.

#### Решение 

```C#
Console.WriteLine("Введите пятизначное число");
string input = Console.ReadLine();

void isPalidrom(string str)
{
    if (str[0] == str[4] && str[1] == str[3])
    {
        Console.WriteLine("Yes");
    }
    else
    {
        Console.WriteLine("NO");
    }
}

isPalidrom(input); 
```

### Задача 2
#### Условие 

Напишите программу, которая принимает на
вход координаты двух точек и находит расстояние
между ними в 3D пространстве.

#### Решение 

```C#
Console.WriteLine("Введите кординату x для точки A");
int XA = int.Parse(Console.ReadLine());
Console.WriteLine("Введите кординату y для точки A");
int YA = int.Parse(Console.ReadLine());
Console.WriteLine("Введите кординату z для точки A");
int ZA =int.Parse(Console.ReadLine());
Console.WriteLine("Введите кординату x для точки B");
int XB = int.Parse(Console.ReadLine());
Console.WriteLine("Введите кординату y для точки B");
int YB = int.Parse(Console.ReadLine());
Console.WriteLine("Введите кординату z для точки B");
int ZB = int.Parse(Console.ReadLine());


double distans (int xa, int ya,  int za,  int xb, int yb, int zb)
{
    int xab = xb - xa;
    int yab = yb - ya;
    int zab = zb - za;
    int sqrtxab = xab * xab;
    int sqrtyab = yab * yab;
    int sqrtzab = zab * zab;
    double result = Math.Sqrt(sqrtxab + sqrtyab + sqrtzab);
    return result;
}

double res = distans(XA, YA, ZA, XB, YB, ZB);
Console.WriteLine(res);
```

### Задача 3 
#### Условие 
Напишите программу, которая принимает на
вход число (N) и выдаёт таблицу кубов чисел от 1 до N.

#### Решение

```C#
Console.WriteLine("Введите число N");
int N = int.Parse(Console.ReadLine());


void cube (int n)
{
    for (int i = 1; i <= n; i++)
    {
        if (n > i)
        {
            Console.WriteLine(i * i + ",");
        }
        else
        {
            Console.WriteLine(i * i);
        }
    }
}

cube(N);
```